html/study.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-25 Sat 11:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ychnh" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb921ce3">1. Mentality</a></li>
<li><a href="#orgf0f0fee">2. Note Taking</a></li>
<li><a href="#orgf70cfeb">3. Time management</a></li>
<li><a href="#orgb2f93a3">4. Reading</a></li>
<li><a href="#orgea74535">5. Problem Solving</a>
<ul>
<li><a href="#org683885a">5.1. Deriving Taylor series</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb921ce3" class="outline-2">
<h2 id="orgb921ce3"><span class="section-number-2">1</span> Mentality</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>The course is a course. Focus on the broad principles that can be applied to all the courses.</li>
<li>It is painful and slow, but you must have faith!</li>
<li>If stuck&#x2026; sometimes work backwards, glance at the solution for an idea, or a hint.</li>
<li>Create an environment or situation that will make you work
<ul class="org-ul">
<li>disorganized notes will make structure the notes</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf0f0fee" class="outline-2">
<h2 id="orgf0f0fee"><span class="section-number-2">2</span> Note Taking</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>First write everything. See if a pattern emerges, and group accordingly.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf70cfeb" class="outline-2">
<h2 id="orgf70cfeb"><span class="section-number-2">3</span> Time management</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>I am sleeping naps after dinner. I really shouldn't do that.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2f93a3" class="outline-2">
<h2 id="orgb2f93a3"><span class="section-number-2">4</span> Reading</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>During each reading session, try to take away a main, simple idea from each topic
<ul class="org-ul">
<li>So you can get something meaningful out of reading</li>
</ul></li>
<li>Looking for similar points when you revisit to study later</li>
<li>Polya: 1 See that the step is correct. 2 See the purpose of the step.
<ul class="org-ul">
<li>See how humanely possible it is to find such an argument</li>
<li>Use the same questions to understand the author's reasoning and feel that he could have discovered it himself by asking the same questions.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgea74535" class="outline-2">
<h2 id="orgea74535"><span class="section-number-2">5</span> Problem Solving</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org683885a" class="outline-3">
<h3 id="org683885a"><span class="section-number-3">5.1</span> Deriving Taylor series</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Is there a reasonable way to naturally guide myself to the solution?</li>
<li>Work with a simpler, subset of the original condition
<ul class="org-ul">
<li>Mindful what variables you can modify to create a simpler problem.</li>
<li>a=0, n=1, n=0</li>
<li>Can we simplify the problem further?</li>
</ul></li>
<li>How can you extend the simpler case to the general case?</li>
<li>What is it that we are trying to do? What is the goal?
<ul class="org-ul">
<li>Can you explicitly state an relationship, condition, or equation of the goal?</li>
</ul></li>
<li>Compare your work with existing methods
<ul class="org-ul">
<li>MVT</li>
</ul></li>
<li>Inspect the interesting properties and requirements and ask how can you use them to solve? or how can you satistfy them?
<ul class="org-ul">
<li>Rolle's requirement f(a)=0, f(b)=0</li>
<li>Reduction due to derivative</li>
</ul></li>
<li>Use these general questions, (work with simpler problem, n=1, n=0, a=0) to as starting points for your work.</li>
<li>Have you really understood the problem?
<ul class="org-ul">
<li>I dont think I was completely mindful of the variables a, b</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ychnh</p>
<p class="date">Created: 2023-11-25 Sat 11:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
